jdk01/src/main/java/com/ssl/foya/pair/Request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <soapenv:Body>
  <ns1:getPrice soapenv:encodingStyle=
    "http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns1="urn:quote">
   <symbol xsi:type="xsd:string">IBM</symbol>
  </ns1:getPrice>
 </soapenv:Body>
</soapenv:Envelope>